---
title: DrawContext
classe: Autodesk.Revit.DB.DirectContext3D.DrawContext
namespace: Autodesk.Revit.DB.DirectContext3D
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 11
---

# DrawContext

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Void FlushBuffer(VertexBuffer, Int32, IndexBuffer, Int32, VertexFormat, EffectInstance, PrimitiveType, Int32, Int32)` | `DrawContext.FlushBuffer(vertexBuffer, vertexCount, indexBuffer, indexCount, vertexFormat, effectInstance, primitiveType, start, primitiveCount)` | Void |
| `Camera GetCamera()` | `DrawContext.GetCamera()` | Camera |
| `IList<ClipPlane> GetClipPlanes()` | `DrawContext.GetClipPlanes()` | IList<ClipPlane> |
| `Rectangle GetClipRectangle()` | `DrawContext.GetClipRectangle()` | Rectangle |
| `Boolean GetOverrideColor(Color&)` | `DrawContext.GetOverrideColor(color)` | Boolean |
| `Boolean GetOverrideTransparency(Double&)` | `DrawContext.GetOverrideTransparency(transparency)` | Boolean |
| `Rectangle GetViewRectangle()` | `DrawContext.GetViewRectangle()` | Rectangle |
| `Boolean IsAvailable()` | `DrawContext.IsAvailable()` | Boolean |
| `Boolean IsInterrupted()` | `DrawContext.IsInterrupted()` | Boolean |
| `Boolean IsTransparentPass()` | `DrawContext.IsTransparentPass()` | Boolean |
| `Void SetWorldTransform(Transform)` | `DrawContext.SetWorldTransform(trf)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```